/**************************************************************************************************************************************************
* Заголовочный файл стандартной библиотеки для контроллера КМ01-8600.М0
* Здесь делаются основные объявления типа и конфигурации контроллера
***************************************************************************************************************************************************/
// --- Объявление типа контроллера ---																															
#ifndef _KM3200_	
#define _KM3200_																																

// +++++++++++++++++++++++++++++++++++++++++++++++ СТЕК ПРОТОКОЛА MODBUS ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// *************** МОДУЛЬ KM01-2442.M *************************************************************************************************************
unsigned int MB_Hreg[64];		// Стек протокола содержащий регистры Holdings (40001) ModBusRTU
unsigned int MB_Ireg[64];		// Стек протокола содержащий регистры Input (30001) ModBusRTU
#define maxAddr_DI 16			// Максимальное число DI
#define maxAddr_DO 16			// Максимальное число D0
#define maxAddrRegHOLD 64		// Максималиное кол - во регистров Holding
#define maxAddrRegINP 64		// Максималиное кол - во регистров Input

// *************** МАКРОСЫ для работы *************************************************************************************************************
#define LD_on	PORTB |= (0x01)		// Включить красный светодиод
#define LD_off	PORTB &=~(0x01)		// Выключить красный светодиод

#define WDR()	asm("wdr")
#define TRUE            1
#define FALSE           0

// *************** Глобальные переменные **********************************************************************************************************
char Address_device;			//Адрес модуля
char Led_flash;					// Регистр флагов таймеров для индикации
char TimerTakt;					// Таймер основной задачи
char TimerLed;					// Время гашения светодиода питания

// *************** Постоянные в flash памяти ******************************************************************************************************
// *************** Заполнять версию ПО и серийный номер контроллера *******************************************************************************
static const char PROGMEM fl_name[] = "KM01-3200.M0";	// Имя контроллера
static const char PROGMEM fl_version[] = "022000";		// Версия ПО контроллера (это программа ни чего не делает!)
static const char PROGMEM fl_progid[] = "090001";		// Серийный номер контроллера

// ********************* Объявления для работы в программе пользователя ***************************************************************************
// *** чтение состояния цифровых входов контроллера *** (здесь использовать для сравнения с 0 -> != 0 | == 0)
#define rdi1	(MB_Ireg[1] & 0x01)
#define rdi2	(MB_Ireg[1] & 0x02)
#define rdi3	(MB_Ireg[1] & 0x04)
// *** чтение состояния цифровых выходов ***
#define rdo1	(MB_Ireg[2] & 0x01)
#define rdo2	(MB_Ireg[2] & 0x02)
// *** чтение состояния счетчиков ***
#define rcnt1	(((unsigned long int)MB_Ireg[12] << 16) + MB_Ireg[11])
#define rcnt2	(((unsigned long int)MB_Ireg[14] << 16) + MB_Ireg[13])
#define rcnt3	(((unsigned long int)MB_Ireg[16] << 16) + MB_Ireg[15])
// *** управление цифровыми выходами ***
#define sdo1_0	(MB_Hreg[5] &= ~(0x01))
#define sdo1_1	(MB_Hreg[5] |=  (0x01))
#define sdo2_0	(MB_Hreg[5] &= ~(0x02))
#define sdo2_1	(MB_Hreg[5] |=  (0x02))

#endif
//************************************************** END *******************************************************************************************